<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of OpenSCAD.</string>
	<key>Identifier</key>
	<string>com.github.peterkelm.download.OpenSCAD</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>OpenSCAD</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>((?P&lt;url&gt;https://[A-Za-z0-9\.\-\/]+/OpenSCAD-(?P&lt;version&gt;\d+([\-\.]\d+)+).dmg))</string>
				<key>result_output_var_name</key>
				<string>url</string>
				<key>url</key>
				<string>https://openscad.org/inc/mac_release_links.js</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
