<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.1.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Tone Room and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.peterkelm.munki.ToneRoom</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string></string>
		<key>NAME</key>
		<string>ToneRoom</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Tone Room.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Unlock the potential of your USB-equipped VOX product with the all-new Tone Room software! Tone Room allows for easier editing of your favorite amp models and effects and also makes for simple organization of your favorite presets. Whether you’re practicing at home or on-the go, VOX Tone Room is a simple and intuitive way to get the most out of your VOX amps by using your PC, Mac, or iOS device!</string>
			<key>developer</key>
			<string>Vox Amplification Ltd.</string>
			<key>category</key>
			<string>Music</string>
			<key>display_name</key>
			<string>Tone Room</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.peterkelm.download.ToneRoom</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%pathname%/Tone Room Installer.pkg</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/TEMP_PKG_FLAT.pkg/Payload</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Applications/VOX/Tone Room/Tone Room.app/Contents/Info.plist</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
    	<dict>
    		<key>Processor</key>
    		<string>MunkiPkginfoMerger</string>
    		<key>Arguments</key>
    		<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>blocking_applications</key>
					<array>
						<string>Tone Room</string>
					</array>
                    <key>minimum_os_version</key>
					<string>10.11</string>
				</dict>	
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
                <key>additional_makepkginfo_options</key>
                <array>
                    <string>--pkgvers=%version%</string>
                </array>

			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
