<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Igor Pro and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.peterkelm.munki.IgorPro</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string></string>
		<key>NAME</key>
		<string>IgorPro</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Igor64.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Igor Pro is an extraordinarily powerful and extensible graphing, data analysis, image processing and programming tool for scientists and engineers.</string>
			<key>developer</key>
			<string>WaveMetrics</string>
			<key>category</key>
			<string>Scientific</string>
			<key>display_name</key>
			<string>Igor Pro</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>installer_type</key>
			<string>copy_from_dmg</string>
			<key>items_to_copy</key>
			<array>
				<dict>
					<key>destination_path</key>
					<string>/Applications</string>
					<key>group</key>
					<string>wheel</string>
					<key>mode</key>
					<string>0755</string>
					<key>source_item</key>
					<string>Igor Pro %MAJOR_VERSION% Folder</string>
					<key>user</key>
					<string>root</string>
				</dict>
			</array>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.peterkelm.download.IgorPro</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                    <key>installs</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>/Applications/Igor Pro %MAJOR_VERSION% Folder/Igor64.app</string>
                            <key>CFBundleIdentifier</key>
                            <string>com.wavemetrics.igorpromach</string>
                            <key>CFBundleShortVersionString</key>
                            <string>%version%</string>
                            <key>minosversion</key>
                            <string>10.13</string>
                            <key>type</key>
                            <string>application</string>
                            <key>version_comparison_key</key>
                            <string>CFBundleShortVersionString</string>
                        </dict>
                    </array>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>munkiimport_appname</key>
				<string>Igor Pro %MAJOR_VERSION% Folder/Igor64.app</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
