<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Imaging Edge Desktop and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.peterkelm.munki.ImagingEdgeDesktop</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string></string>
		<key>NAME</key>
		<string>ImagingEdgeDesktop</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Imaging Edge Desktop.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Imaging Edge is a suite of applications that extend the capabilities of Sony cameras, and improve the quality and efficiency of photographic works.</string>
			<key>developer</key>
			<string>Sony</string>
			<key>display_name</key>
			<string>Imaging Edge Desktop</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>minimum_os_version</key>
			<string>10.12</string>
			<key>unattended_install</key>
			<true/>
			<key>uninstall_script</key>
			<string>## Kill Process
pgrep "Imaging Edge Desktop" | xargs kill -9

## Remove login service
echo "Removing Login Service"
osascript -e 'tell application "System Events" to delete login item "Imaging Edge Desktop"' 

## Remove application
echo "Removing Imaging Edge Desktop from /Applications/ folder"
/bin/rm -r /Applications/Imaging\ Edge\ Desktop.app;

## Forget we ever got installed
echo "Removing installation info"
/usr/sbin/pkgutil --forget com.sony.ImagingEdgeDesktop.pkg;
/bin/rm -f ~/Library/Preferences/com.sony.ImagingEdgeDesktop.plist;
/usr/bin/defaults delete com.sony.ImagingEdgeDesktop;
killall -HUP cfprefsd

echo "Done."
			</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.peterkelm.download.ImagingEdgeDesktop</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/payload/</string>  
                    <string>%RECIPE_CACHE_DIR%/unpack/</string>                      
                </array>
            </dict>
        </dict>
	</array>
</dict>
</plist>
